{
  "timestamp": "2025-08-13T09:45:18.646937",
  "step": "literature_survey",
  "topic": "Electric cars",
  "data": [
    "Paper(id='openalex_2983762108', title='Recycling lithium-ion batteries from electric vehicles', authors=['Gavin Harper', 'Roberto Sommerville', 'Emma Kendrick', 'Laura L. Driscoll', 'Peter R. Slater', 'Rustam Stolkin', 'Allan Walton', 'Paul A. Christensen', 'Oliver Heidrich', 'Simon Lambert', 'Andrew P. Abbott', 'Karl S. Ryder', 'Linda Gaines', 'Paul A. Anderson'], abstract='Abstract not available', url='https://openalex.org/W2983762108', published_date=None, venue='Nature', citations=2774, pdf_path=None, full_text=None, keywords=[], doi='10.1038/s41586-019-1682-5', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 647740))",
    "Paper(id='openalex_2798241172', title='Batteries and fuel cells for emerging electric vehicle markets', authors=['Zachary P. Cano', 'Dustin Banham', 'Siyu Ye', 'Andreas Hintennach', 'Jun Lü', 'Michael Fowler', 'Zhongwei Chen'], abstract='Abstract not available', url='https://openalex.org/W2798241172', published_date=None, venue='Nature Energy', citations=2521, pdf_path=None, full_text=None, keywords=[], doi='10.1038/s41560-018-0108-1', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 647740))",
    "Paper(id='arxiv_2411.11762v2', title='High-Speed Cornering Control and Real-Vehicle Deployment for Autonomous Electric Vehicles', authors=['Shiyue Zhao', 'Junzhi Zhang', 'Neda Masoud', 'Yuhong Jiang', 'Heye Huang', 'Tao Liu'], abstract=\"Executing drift maneuvers during high-speed cornering presents significant challenges for autonomous vehicles, yet offers the potential to minimize turning time and enhance driving dynamics. While reinforcement learning (RL) has shown promising results in simulated environments, discrepancies between simulations and real-world conditions have limited its practical deployment. This study introduces an innovative control framework that integrates trajectory optimization with drift maneuvers, aiming to improve the algorithm's adaptability for real-vehicle implementation. We leveraged Bezier-based pre-trajectory optimization to enhance rewards and optimize the controller through Twin Delayed Deep Deterministic Policy Gradient (TD3) in a simulated environment. For real-world deployment, we implement a hybrid RL-MPC fusion mechanism, , where TD3-derived maneuvers serve as primary inputs for a Model Predictive Controller (MPC). This integration enables precise real-time tracking of the optimal trajectory, with MPC providing corrective inputs to bridge the gap between simulation and reality. The efficacy of this method is validated through real-vehicle tests on consumer-grade electric vehicles, focusing on drift U-turns and drift right-angle turns. The control outcomes of these real-vehicle tests are thoroughly documented in the paper, supported by supplementary video evidence (https://youtu.be/5wp67FcpfL8). Notably, this study is the first to deploy and apply an RL-based transient drift cornering algorithm on consumer-grade electric vehicles.\", url='http://arxiv.org/abs/2411.11762v2', published_date=datetime.datetime(2024, 11, 18, 17, 40, 43, tzinfo=datetime.timezone.utc), venue='arXiv:cs.RO (Robotics)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='2411.11762v2', created_at=datetime.datetime(2025, 8, 13, 9, 44, 58, 885829))",
    "Paper(id='arxiv_2410.01685v1', title='Effects of eco-driving on energy consumption and battery degradation for electric vehicles at signalized intersections', authors=['Yongqiang Wang', 'Suresh G. Advani', 'Ajay K. Prasad'], abstract=\"Eco-driving has been shown to reduce energy consumption for electric vehicles (EVs). Such strategies can also be implemented to both reduce energy consumption and improve battery lifetime. This study considers the eco-driving of a connected electric vehicle equipped with vehicle-to-infrastructure (V2I) communication passing through two signalized intersections. Dynamic programming is employed to construct an eco-driving algorithm that incorporates a battery degradation model in addition to minimizing energy consumption to optimize the vehicle's speed trajectory while transiting the control zone. A parametric study is conducted for various signal timings and distances between the two intersections. It is found that eco-driving can provide up to 49\\\\% in cost benefits over regular driving due to energy savings and improved battery life which could boost consumers' interests on EVs. This study also considered different battery capacity decay rates based on battery chemistry. Although a higher decay rate affects the optimal speed trajectories only slightly, it amplifies the benefits of eco-driving on battery life. Two battery sizes were also studied to show that the larger battery is associated with a drastically increased lifetime, thus creating opportunities for electric vehicles in other applications such as vehicle-to-grid (V2G) integration. Field tests were also conducted using a simplified rule-based version of the eco-driving algorithm implemented as a phone app which issues audio speed recommendations to the driver. The field test results were promising and validated the results from simulations. The phone app implementation is convenient and could facilitate broader adoption and widespread use of eco-driving which helps to improve transportation efficiency and protect the environment.\", url='http://arxiv.org/abs/2410.01685v1', published_date=datetime.datetime(2024, 10, 2, 15, 54, 41, tzinfo=datetime.timezone.utc), venue='arXiv:eess.SY (Systems and Control)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='2410.01685v1', created_at=datetime.datetime(2025, 8, 13, 9, 45, 1, 887643))",
    "Paper(id='arxiv_2112.12769v2', title='Joint Routing of Conventional and Range-Extended Electric Vehicles in a Large Metropolitan Network', authors=['Anirudh Subramanyam', 'Taner Cokyasar', 'Jeffrey Larson', 'Monique Stinson'], abstract='Range-extended electric vehicles combine the higher efficiency and environmental benefits of battery-powered electric motors with the longer mileage and autonomy of conventional internal combustion engines. This combination is particularly advantageous for time-constrained delivery routing in dense urban areas, where battery recharging along routes can be too time-consuming to economically justify the use of all-electric vehicles. However, switching from electric to conventional fossil fuel modes also results in higher costs and emissions and lower efficiency. This paper analyzes this heterogeneous vehicle routing problem and describes two solution methods: an exact branch-price-and-cut algorithm and an iterated tabu search metaheuristic. From a methodological perspective, we find that the exact algorithm consistently obtains tight lower bounds that also serve to certify the metaheuristic solutions as near-optimal. From a policy standpoint, we examine a large-scale real-world case study concerning parcel deliveries in the Chicago metropolitan area and quantify various operational metrics including energy costs and vehicle miles traveled. We find that by deploying roughly 20% of range-extended vehicles with a modest all-electric range of 33 miles, parcel distributors can save energy costs by up to 17% while incurring less than 0.5% increase in vehicle miles traveled. Increasing the range to 60 miles further reduces costs by only 4%, which can alternatively be achieved by decreasing the average service time by 1 minute or increasing driver working time by 1 hour. Our study reveals several key areas of improvement on which vehicle manufacturers, distributors, and policy makers can focus their attention.', url='http://arxiv.org/abs/2112.12769v2', published_date=datetime.datetime(2021, 12, 23, 18, 46, 34, tzinfo=datetime.timezone.utc), venue='arXiv:math.OC (Optimization and Control)', citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.1016/j.trc.2022.103830', arxiv_id='2112.12769v2', created_at=datetime.datetime(2025, 8, 13, 9, 44, 58, 885829))",
    "Paper(id='arxiv_2108.04036v1', title='Fed-BEV: A Federated Learning Framework for Modelling Energy Consumption of Battery Electric Vehicles', authors=['Mingming Liu'], abstract='Recently, there has been an increasing interest in the roll-out of electric vehicles (EVs) in the global automotive market. Compared to conventional internal combustion engine vehicles (ICEVs), EVs can not only help users reduce monetary costs in their daily commuting, but also can effectively help mitigate the increasing level of traffic emissions produced in cities. Among many others, battery electric vehicles (BEVs) exclusively use chemical energy stored in their battery packs for propulsion. Hence, it becomes important to understand how much energy can be consumed by such vehicles in various traffic scenarios towards effective energy management. To address this challenge, we propose a novel framework in this paper by leveraging the federated learning approaches for modelling energy consumption for BEVs (Fed-BEV). More specifically, a group of BEVs involved in the Fed-BEV framework can learn from each other to jointly enhance their energy consumption model. We present the design of the proposed system architecture and implementation details in a co-simulation environment. Finally, comparative studies and simulation results are discussed to illustrate the efficacy of our proposed framework for accurate energy modelling of BEVs.', url='http://arxiv.org/abs/2108.04036v1', published_date=datetime.datetime(2021, 8, 5, 1, 56, 9, tzinfo=datetime.timezone.utc), venue='arXiv:cs.LG (Machine Learning)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='2108.04036v1', created_at=datetime.datetime(2025, 8, 13, 9, 45, 1, 887643))",
    "Paper(id='arxiv_2410.16425v2', title='Advancements in Electric Vehicle Charging Optimization: A Survey of Reinforcement Learning Approaches', authors=['Mehrshad Shokati', 'Parisa Mohammadi', 'Atoosa Amirinian'], abstract='In response to global warming and energy shortages, there has been a significant shift towards integrating renewable energy sources, energy storage systems, and electric vehicles. Deploying electric vehicles within smart grids offers a promising solution to reduce carbon emissions. However, managing the charging and discharging processes of them as distributed power supplies present significant challenges. Additionally, the intermittent nature of renewable energy, uncertainties in electric vehicle-related parameters, fluctuating energy prices, and varying loads make maintaining stable power system operations more complex. Effective management systems for electric vehicle battery charging are crucial to coordinating these processes and ensuring a secure, efficient, and reliable power system. Reinforcement learning, enhanced by deep learning, has gained substantial interest for its model-free approach and real-time optimization, effectively managing electric vehicle charging by maximizing cumulative rewards. This review synthesizes existing literature on reinforcement learning-based frameworks, objectives, and architectures for electric vehicle charging coordination strategies in power systems, classifying methods into centralized and decentralized categories. Additionally, the article offers suggestions for future research directions to further enhance reinforcement learning-based electric vehicle charging optimization.', url='http://arxiv.org/abs/2410.16425v2', published_date=datetime.datetime(2024, 10, 21, 18, 47, 41, tzinfo=datetime.timezone.utc), venue='arXiv:eess.SY (Systems and Control)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='2410.16425v2', created_at=datetime.datetime(2025, 8, 13, 9, 44, 55, 884276))",
    "Paper(id='arxiv_2306.01888v1', title=\"Consumer's Behavior Analysis of Electric Vehicle using Cloud Computing in the State of New York\", authors=['Jairo Juarez', 'Wendy Flores', 'Zhenfei Lu', 'Mako Hattori', 'Melissa Hernandez', 'Safir Larios-Ramirez', 'Jongwook Woo'], abstract=\"Sales of Electric Vehicles (EVs) in the United States have grown fast in the past decade. We analyze the Electric Vehicle Drive Clean Rebate data from the New York State Energy Research and Development Authority (NYSERDA) to understand consumer behavior in EV purchasing and their potential environmental impact. Based on completed rebate applications since 2017, this dataset features the make and model of the EV that consumers purchased, the geographic location of EV consumers, transaction type to obtain the EV, projected environmental impact, and tax incentive issued. This analysis consists of a mapped and calculated statistical data analysis over an established period. Using the SAP Analytics Cloud (SAC), we first import and clean the data to generate statistical snapshots for some primary attributes. Next, different EV options were evaluated based on environmental carbon footprints and rebate amounts. Finally, visualization, geo, and time-series analysis presented further insights and recommendations. This analysis helps the reader to understand consumers' EV buying behavior, such as the change of most popular maker and model over time, acceptance of EVs in different regions in New York State, and funds required to support clean air initiatives. Conclusions from the current study will facilitate the use of renewable energy, reduce reliance on fossil fuels, and accelerate economic growth sustainably, in addition to analyzing the trend of rebate funding size over the years and predicting future funding.\", url='http://arxiv.org/abs/2306.01888v1', published_date=datetime.datetime(2023, 6, 2, 19, 49, 18, tzinfo=datetime.timezone.utc), venue='arXiv:cs.AI (Artificial Intelligence)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='2306.01888v1', created_at=datetime.datetime(2025, 8, 13, 9, 45, 0, 386762))",
    "Paper(id='arxiv_2508.08398v1', title='The economic, social & Environmental impact of Electric Vehicle (EV) adaptation on Bangladeshi Society', authors=['Abdullah Al Noman', 'Hasibul Hassan Siam'], abstract=\"This study examines the economic social and environmental impacts of electric vehicle adoption in Bangladesh using survey data from 57 respondents and secondary research. Findings show strong public perception of electric vehicles as cost effective with ninety three percent agreement and environmentally beneficial with eighty two point five percent agreement. Electric vehicles have potential to reduce fuel imports lower operational costs and create over fifty thousand jobs by 2030. Socially electric vehicles improve mobility for low income groups with seventy five point four percent agreement and increase safety although adoption remains mostly in urban areas. Environmentally electric vehicles could reduce carbon dioxide emissions by up to thirty percent per kilometre and lower particulate matter levels by twenty to twenty five percent in Dhaka along with a three to five decibel reduction in traffic noise. Main barriers include high purchase costs limited charging infrastructure and low public awareness of policies. Policy recommendations include tax incentives solar powered charging stations and battery recycling regulations. This research concludes that strategic electric vehicle adoption could advance Bangladesh's sustainable transportation economic resilience and public health goals.\", url='http://arxiv.org/abs/2508.08398v1', published_date=datetime.datetime(2025, 8, 11, 18, 43, 37, tzinfo=datetime.timezone.utc), venue='arXiv:econ.GN', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='2508.08398v1', created_at=datetime.datetime(2025, 8, 13, 9, 44, 57, 385067))",
    "Paper(id='arxiv_1712.07300v1', title='Plug-in Electric Vehicle Charging Congestion Analysis Using Taxi Travel Data in the Central Area of Beijing', authors=['Huimiao Chen', 'Hongcai Zhang', 'Zechun Hu', 'Yunyi Liang', 'Haocheng Luo', 'Yinhai Wang'], abstract=\"Recharging a plug-in electric vehicle is more time-consuming than refueling an internal combustion engine vehicle. As a result, charging stations may face serious congestion problems during peak traffic hours in the near future with the rapid growth of plug-in electric vehicle population. Considering that drivers' time costs are usually expensive, charging congestion will be a dominant factor that affect a charging station's quality of service. Hence, it is indispensable to conduct adequate congestion analysis when designing charging stations in order to guarantee acceptable quality of service in the future. This paper proposes a data-driven approach for charging congestion analysis of plug-in electric vehicle charging stations. Based on a data-driven plug-in electric vehicle charging station planning model, we adopt the queuing theory to model and analyze the charging congestion phenomenon in these planning results. We simulate and analyze the proposed method for charging stations servicing shared-use electric taxis in the central area of Beijing leveraging real-world taxi travel data.\", url='http://arxiv.org/abs/1712.07300v1', published_date=datetime.datetime(2017, 12, 19, 6, 43, 58, tzinfo=datetime.timezone.utc), venue='arXiv:cs.AI (Artificial Intelligence)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='1712.07300v1', created_at=datetime.datetime(2025, 8, 13, 9, 44, 57, 385067))",
    "Paper(id='arxiv_2307.03808v1', title='A Regional Analysis of Electric LDV Portfolio Choices by Vehicle Manufacturers', authors=['Aditya Ramji', 'Hanif Tayarani'], abstract=\"Global light duty electric vehicle (EV) sales exceeded 10.5 million units in 2022, with a year-on-year growth of 55%, but these trends differ regionally. Despite the robust growth, upfront purchase price remains a challenge for consumers in different regions, and thus, OEMs make technology choices to respond to market needs. This paper examines the electrification portfolio choices of three major automotive manufacturers (OEMs) in different regions of the world, including Europe, Americas, Asia Pacific, and Africa/Middle-East. The analysis focuses on trends in dominant segments for Battery Electric Vehicles (BEV) and Plug-in Hybrid Electric Vehicles (PHEV), as well as battery chemistry choices. Regional differences show a trend towards SUVs for both BEVs and PHEVs. Tesla's dominance in the BEV market influences battery chemistry choices. Average battery sizes for BEVs remain similar in Europe and Americas, but lower in Asia Pacific and Africa/Middle East.\", url='http://arxiv.org/abs/2307.03808v1', published_date=datetime.datetime(2023, 7, 7, 19, 31, 20, tzinfo=datetime.timezone.utc), venue='arXiv:econ.GN', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='2307.03808v1', created_at=datetime.datetime(2025, 8, 13, 9, 45, 1, 887643))",
    "Paper(id='arxiv_1905.11606v2', title='Perceived Advantage in Perspective Application of Integrated Choice and Latent Variable Model to Capture Electric Vehicles Perceived Advantage from Consumers Perspective', authors=['Milad Ghasri', 'Ali Ardeshiri', 'Taha Rashidi'], abstract='Relative advantage, or the degree to which a new technology is perceived to be better over the existing technology it supersedes, has a significant impact on individuals decision of adopting to the new technology. This paper investigates the impact of electric vehicles perceived advantage over the conventional internal combustion engine vehicles, from consumers perspective, on their decision to select electric vehicles. Data is obtained from a stated preference survey from 1176 residents in New South Wales, Australia. The collected data is used to estimate an integrated choice and latent variable model of electric vehicle choice, which incorporates the perceived advantage of electric vehicles in the form of latent variables in the utility function. The design of the electric vehicle, impact on the environment, and safety are three identified advantages from consumers point of view. The model is used to simulate the effectiveness of various policies to promote electric vehicles on different cohorts. Rebate on the purchase price is found to be the most effective strategy to promote electric vehicles adoption.', url='http://arxiv.org/abs/1905.11606v2', published_date=datetime.datetime(2019, 5, 28, 4, 41, 42, tzinfo=datetime.timezone.utc), venue='arXiv:econ.GN', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='1905.11606v2', created_at=datetime.datetime(2025, 8, 13, 9, 44, 55, 884276))",
    "Paper(id='arxiv_1907.09458v1', title='A Stochastic Model for Uncontrolled Charging of Electric Vehicles Using Cluster Analysis', authors=['Constance Crozier', 'Thomas Morstyn', 'Malcolm McCulloch'], abstract='This paper proposes a probabilistic model for uncontrolled charging of electric vehicles (EVs). EV charging will add significant load to power systems in the coming years and, due to the convenience of charging at home, this is likely to occur in residential distribution systems. Estimating the size and shape of the load will allow necessary reinforcements to be identified. Models predicting EV charging are usually based on data from travel surveys, or from small trials. Travel surveys are recorded by hand and typically describe conventional vehicles, but represent a much larger and more diverse sample of the population. The model here utilizes both sources: trial data to parameterize the model, and survey data as the model input. Clustering is used to identify modes of vehicle use, thus reducing vehicle use to a single parameter -- which can be incorporated into the model without adding significant computational burden. Two case studies are included: one investigating the aggregated charging of 50 vehicles, and one predicting the increase in after diversity maximum demand for different regions of the UK.', url='http://arxiv.org/abs/1907.09458v1', published_date=datetime.datetime(2019, 7, 17, 11, 36, 47, tzinfo=datetime.timezone.utc), venue='arXiv:eess.SP (Signal Processing)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='1907.09458v1', created_at=datetime.datetime(2025, 8, 13, 9, 45, 0, 386762))",
    "Paper(id='arxiv_1808.03897v1', title='Engineering and Economic Analysis for Electric Vehicle Charging Infrastructure --- Placement, Pricing, and Market Design', authors=['Chao Luo'], abstract='This dissertation is to study the interplay between large-scale electric vehicle (EV) charging and the power system. We address three important issues pertaining to EV charging and integration into the power system: (1) charging station placement, (2) pricing policy and energy management strategy, and (3) electricity trading market and distribution network design to facilitate integrating EV and renewable energy source (RES) into the power system. For charging station placement problem, we propose a multi-stage consumer behavior based placement strategy with incremental EV penetration rates and model the EV charging industry as an oligopoly where the entire market is dominated by a few charging service providers (oligopolists). The optimal placement policy for each service provider is obtained by solving a Bayesian game. For pricing and energy management of EV charging stations, we provide guidelines for charging service providers to determine charging price and manage electricity reserve to balance the competing objectives of improving profitability, enhancing customer satisfaction, and reducing impact on the power system. Two algorithms --- stochastic dynamic programming (SDP) algorithm and greedy algorithm (benchmark algorithm) are applied to derive the pricing and electricity procurement strategy. We design a novel electricity trading market and distribution network, which supports seamless RES integration, grid to vehicle (G2V), vehicle to grid (V2G), vehicle to vehicle (V2V), and distributed generation (DG) and storage. We apply a sharing economy model to the electricity sector to stimulate different entities to exchange and monetize their underutilized electricity. A fitness-score (FS)-based supply-demand matching algorithm is developed by considering consumer surplus, electricity network congestion, and economic dispatch.', url='http://arxiv.org/abs/1808.03897v1', published_date=datetime.datetime(2018, 8, 12, 6, 5, 8, tzinfo=datetime.timezone.utc), venue='arXiv:econ.EM', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='1808.03897v1', created_at=datetime.datetime(2025, 8, 13, 9, 44, 55, 884276))",
    "Paper(id='arxiv_2105.02905v3', title='Securing the Electric Vehicle Charging Infrastructure', authors=['Roberto Metere', 'Myriam Neaimeh', 'Charles Morisset', 'Carsten Maple', 'Xavier Bellekens', 'Ricardo M. Czekster'], abstract='Electric Vehicles (EVs) can help alleviate our reliance on fossil fuels for transport and electricity systems. However, charging millions of EV batteries requires management to prevent overloading the electricity grid and minimise costly upgrades that are ultimately paid for by consumers. Managed chargers, such as Vehicle-to-Grid (V2G) chargers, allow control over the time, speed and direction of charging. Such control assists in balancing electricity supply and demand across a green electricity system and could reduce costs for consumers. Smart and V2G chargers connect EVs to the power grid using a charging device which includes a data connection to exchange information and control commands between various entities in the EV ecosystem. This introduces data privacy concerns and is a potential target for cyber-security attacks. Therefore, the implementation of a secure system is crucial to permit both consumers and electricity system operators to trust smart charging and V2G. In principle, we already have the technology needed for a connected EV charging infrastructure to be securely enabled, borrowing best practices from the Internet and industrial control systems. We must properly adapt the security technology to take into account the challenges peculiar to the EV charging infrastructure. Challenges go beyond technical considerations and other issues arise such as balancing trade-offs between security and other desirable qualities such as interoperability, scalability, crypto-agility, affordability and energy efficiency. This document reviews security and privacy topics relevant to the EV charging ecosystem with a focus on smart charging and V2G.', url='http://arxiv.org/abs/2105.02905v3', published_date=datetime.datetime(2021, 5, 6, 18, 10, 42, tzinfo=datetime.timezone.utc), venue='arXiv:cs.CR (Cryptography and Security)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='2105.02905v3', created_at=datetime.datetime(2025, 8, 13, 9, 45, 0, 386762))",
    "Paper(id='arxiv_1405.6230v2', title='Changing minds about electric cars: An empirically grounded agent-based modeling approach', authors=['Ingo Wolf', 'Tobias Schroeder', 'Jochen Neumann', 'Gerhard de Haan'], abstract='The diffusion of electric vehicles (EVs) is considered an effective policy strategy to meet greenhouse gas reduction targets. For large-scale adoption, however, demand-side oriented policy measures are required, based on consumers transport needs, values and social norms. We introduce an empirically grounded, spatially explicit, agent-based model, InnoMind Innovation diffusion driven by changing Minds), to simulate the effects of policy interventions and social influence on consumers transport mode preferences. The agents in this model represent individual consumers. They are calibrated based on empirically derived attributes and characteristics of survey respondents. We model agent decision-making with artificial neural networks that account for the role of emotions in information processing. We present simulations of 4 scenarios for the diffusion of EVs in the city of Berlin, Germany (3 policy scenarios and 1 base case). The results illustrate the varying effectiveness of measures in different market segments and the need for appropriate policies tailored to the heterogeneous needs of different travelers. Moreover, the simulations suggest that introducing an exclusive zone for EVs in the city would accelerate the early-phase diffusion of EVs more effectively than financial incentives only.', url='http://arxiv.org/abs/1405.6230v2', published_date=datetime.datetime(2014, 5, 23, 21, 0, 47, tzinfo=datetime.timezone.utc), venue='arXiv:cs.AI (Artificial Intelligence)', citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.1016/j.techfore.2014.10.010', arxiv_id='1405.6230v2', created_at=datetime.datetime(2025, 8, 13, 9, 44, 55, 884276))",
    "Paper(id='arxiv_1304.2329v1', title='Socially optimal charging strategies for electric vehicles', authors=['Elena Yudovina', 'George Michailidis'], abstract='Electric vehicles represent a promising technology for reducing emissions and dependence on fossil fuels and have started entering different automotive markets. In order to bolster their adoption by consumers and hence enhance their penetration rate, a charging station infrastructure needs to be deployed. This paper studies decentralized policies that assign electric vehicles to a network of charging stations with the goal to achieve little to no queueing. This objective is especially important for electric vehicles, whose charging times are fairly long. The social optimality of the proposed policies is established in the many-server regime, where each station is equipped with multiple charging slots. Further, convergence issues of the algorithm that achieves the optimal policy are examined. Finally, the results provide insight on how to address questions related to the optimal location deployment of the infrastructure.', url='http://arxiv.org/abs/1304.2329v1', published_date=datetime.datetime(2013, 4, 8, 19, 35, 15, tzinfo=datetime.timezone.utc), venue='arXiv:math.OC (Optimization and Control)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='1304.2329v1', created_at=datetime.datetime(2025, 8, 13, 9, 45, 1, 887643))",
    "Paper(id='arxiv_1501.06957v2', title='Critical behaviour in charging of electric vehicles', authors=['Rui Carvalho', 'Lubos Buzna', 'Richard Gibbens', 'Frank Kelly'], abstract='The increasing penetration of electric vehicles over the coming decades, taken together with the high cost to upgrade local distribution networks and consumer demand for home charging, suggest that managing congestion on low voltage networks will be a crucial component of the electric vehicle revolution and the move away from fossil fuels in transportation. Here, we model the max-flow and proportional fairness protocols for the control of congestion caused by a fleet of vehicles charging on two real-world distribution networks. We show that the system undergoes a continuous phase transition to a congested state as a function of the rate of vehicles plugging to the network to charge. We focus on the order parameter and its fluctuations close to the phase transition, and show that the critical point depends on the choice of congestion protocol. Finally, we analyse the inequality in the charging times as the vehicle arrival rate increases, and show that charging times are considerably more equitable in proportional fairness than in max-flow.', url='http://arxiv.org/abs/1501.06957v2', published_date=datetime.datetime(2015, 1, 28, 0, 17, 11, tzinfo=datetime.timezone.utc), venue='arXiv:math.OC (Optimization and Control)', citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.1088/1367-2630/17/9/095001', arxiv_id='1501.06957v2', created_at=datetime.datetime(2025, 8, 13, 9, 44, 58, 885829))",
    "Paper(id='arxiv_1112.0697v1', title='A Dynamic Algorithm for Facilitated Charging of Plug-In Electric Vehicles', authors=['Nicole Taheri', 'Robert Entriken', 'Yinyu Ye'], abstract='Plug-in Electric Vehicles (PEVs) are a rapidly developing technology that can reduce greenhouse gas emissions and change the way vehicles obtain power. PEV charging stations will most likely be available at home and at work, and occasionally be publicly available, offering flexible charging options. Ideally, each vehicle will charge during periods when electricity prices are relatively low, to minimize the cost to the consumer and maximize societal benefits. A Demand Response (DR) service for a fleet of PEVs could yield such charging schedules by regulating consumer electricity use during certain time periods, in order to meet an obligation to the market. We construct an automated DR mechanism for a fleet of PEVs that facilitates vehicle charging to ensure the demands of the vehicles and the market are met. Our dynamic algorithm depends only on the knowledge of a few hundred driving behaviors from a previous similar day, and uses a simple adjusted pricing scheme to instantly assign feasible and satisfactory charging schedules to thousands of vehicles in a fleet as they plug-in. The charging schedules generated using our adjusted pricing scheme can ensure that a new demand peak is not created and can reduce the consumer cost by over 30% when compared to standard charging, which may also increase peak demand by 3.5%. In this paper, we present our formulation, algorithm and results.', url='http://arxiv.org/abs/1112.0697v1', published_date=datetime.datetime(2011, 12, 3, 22, 21, 21, tzinfo=datetime.timezone.utc), venue='arXiv:math.OC (Optimization and Control)', citations=0, pdf_path=None, full_text=None, keywords=[], doi=None, arxiv_id='1112.0697v1', created_at=datetime.datetime(2025, 8, 13, 9, 44, 57, 385067))",
    "Paper(id='openalex_2019903682', title='Nanomaterials for Rechargeable Lithium Batteries', authors=['Peter G. Bruce', 'Bruno Scrosati', 'Jean‐Marie Tarascon'], abstract='Energy storage is more important today than at any time in human history. Future generations of rechargeable lithium batteries are required to power portable electronic devices (cellphones, laptop computers etc.), store electricity from renewable sources, and as a vital component in new hybrid electric vehicles. To achieve the increase in energy and power density essential to meet the future challenges of energy storage, new materials chemistry, and especially new nanomaterials chemistry, is essential. We must find ways of synthesizing new nanomaterials with new properties or combinations of properties, for use as electrodes and electrolytes in lithium batteries. Herein we review some of the recent scientific advances in nanomaterials, and especially in nanostructured materials, for rechargeable lithium-ion batteries.', url='https://openalex.org/W2019903682', published_date=None, venue='Angewandte Chemie International Edition', citations=5758, pdf_path=None, full_text=None, keywords=[], doi='10.1002/anie.200702505', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 646735))",
    "Paper(id='crossref_10_3390_wevj15070294', title='Exploring the Relationship between Supply Chain Agility, Consumer and Electric Vehicle Characteristics, and Purchase Intentions in Thailand: A Structural Equation Modeling Approach', authors=['Adisak Suvittawat'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.3390/wevj15070294', published_date=datetime.datetime(2024, 7, 2, 0, 0), venue='World Electric Vehicle Journal', citations=1, pdf_path=None, full_text=None, keywords=[], doi='10.3390/wevj15070294', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_1109_tce_2024_3442932', title='Empowering Consumer Electric Vehicle Mobile Charging Services With Secure Profit Optimization', authors=['Zeinab Teimoori', 'Abdulsalam Yassine', 'M. Shamim Hossain'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.1109/tce.2024.3442932', published_date=datetime.datetime(2024, 1, 1, 0, 0), venue='IEEE Transactions on Consumer Electronics', citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.1109/tce.2024.3442932', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='openalex_2122529435', title='The Theory of Capital Structure', authors=['Milton Harris', 'Artur Raviv'], abstract='ABSTRACT This paper surveys capital structure theories based on agency costs, asymmetric information, product/input market interactions, and corporate control considerations (but excluding tax‐based theories). For each type of model, a brief overview of the papers surveyed and their relation to each other is provided. The central papers are described in some detail, and their results are summarized and followed by a discussion of related extensions. Each section concludes with a summary of the main implications of the models surveyed in the section. Finally, these results are collected and compared to the available evidence. Suggestions for future research are provided.', url='https://openalex.org/W2122529435', published_date=None, venue='The Journal of Finance', citations=4007, pdf_path=None, full_text=None, keywords=[], doi='10.1111/j.1540-6261.1991.tb03753.x', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 647740))",
    "Paper(id='openalex_2025883194', title='A framework of sustainable supply chain management: moving toward new theory', authors=['Craig R. Carter', 'Dale S. Rogers'], abstract=\"Abstract Purpose – The authors perform a large‐scale literature review and use conceptual theory building to introduce the concept of sustainability to the field of supply chain management and demonstrate the relationships among environmental, social, and economic performance within a supply chain management context. Design/methodology/approach – Conceptual theory building is used to develop a framework and propositions representing a middle theory of sustainable supply chain management (SSCM). Findings – The authors introduce the concept of sustainability – the integration of environmental, social, and economic criteria that allow an organization to achieve long‐term economic viability – to the logistics literature, and position sustainability within the broader rubric of SSCM. They then present a framework of SSCM and develop research propositions based on resource dependence theory, transaction cost economics, population ecology, and the resource‐based view of the firm. The authors conclude by discussing managerial implications and future research directions, including the further development and testing of the framework's propositions. Originality/value – This paper provides a comprehensive review of the sustainability literature, introduces sustainability to the field of supply chain management, and expands the conceptualization of sustainability beyond the triple bottom line to consider key supporting facets which are posited to be requisites to implementing SSCM practices. The use of conceptual theory building to develop theoretically based propositions moves the concept of sustainability from a relatively a‐theoretical treatment toward new theory in supply chain management.\", url='https://openalex.org/W2025883194', published_date=None, venue='International Journal of Physical Distribution & Logistics Management', citations=3687, pdf_path=None, full_text=None, keywords=[], doi='10.1108/09600030810882816', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 647740))",
    "Paper(id='crossref_10_1002_er_3640', title='A comprehensive review on theoretical framework-based electric vehicle consumer adoption research', authors=['Nadia Adnan', 'Shahrina Md Nordin', 'Imran Rahman', 'Pandian M. Vasant', 'Amir Noor'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.1002/er.3640', published_date=datetime.datetime(2017, 3, 10, 0, 0), venue='International Journal of Energy Research', citations=108, pdf_path=None, full_text=None, keywords=[], doi='10.1002/er.3640', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_3390_wevj10010011', title='An Analysis of Consumer Incentives in Support of Electric Vehicle Uptake: An Australian Case Study', authors=['Gail Helen Broadbent', 'Graciela Metternicht', 'Danielle Drozdzewski'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.3390/wevj10010011', published_date=datetime.datetime(2019, 3, 4, 0, 0), venue='World Electric Vehicle Journal', citations=52, pdf_path=None, full_text=None, keywords=[], doi='10.3390/wevj10010011', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_3390_wevj12010049', title='Retraction: Codani, P., et al. Coupling Local Renewable Energy Production with Electric Vehicle Charging: A Survey of the French Case. World Electr. Veh. J. 2015, 7, 489–499', authors=[], abstract='Abstract not available from CrossRef', url='https://doi.org/10.3390/wevj12010049', published_date=datetime.datetime(2021, 3, 23, 0, 0), venue='World Electric Vehicle Journal', citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.3390/wevj12010049', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='openalex_1983150389', title='New Environmental Theories: Toward a Coherent Theory of Environmentally Significant Behavior', authors=['Paul C. Stern'], abstract=\"This article develops a conceptual framework for advancing theories of environmentally significant individual behavior and reports on the attempts of the author's research group and others to develop such a theory. It discusses definitions of environmentally significant behavior; classifies the behaviors and their causes; assesses theories of environmentalism, focusingespecially on value‐belief‐norm theory; evaluates the relationship between environmental concern and behavior; and summarizes evidence on the factors that determine environmentally significant behaviors and that can effectively alter them. The article concludes by presenting some major propositions supported by available research and some principles for guiding future research and informing the design of behavioral programs for environmental protection.\", url='https://openalex.org/W1983150389', published_date=None, venue='Journal of Social Issues', citations=7368, pdf_path=None, full_text=None, keywords=[], doi='10.1111/0022-4537.00175', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 646735))",
    "Paper(id='openalex_2150704630', title='Agent-based modeling: Methods and techniques for simulating human systems', authors=['Eric Bonabeau'], abstract='Agent-based modeling is a powerful simulation modeling technique that has seen a number of applications in the last few years, including applications to real-world business problems. After the basic principles of agent-based simulation are briefly introduced, its four areas of application are discussed by using real-world applications: flow simulation, organizational simulation, market simulation, and diffusion simulation. For each category, one or several business applications are described and analyzed.', url='https://openalex.org/W2150704630', published_date=None, venue='Proceedings of the National Academy of Sciences', citations=4265, pdf_path=None, full_text=None, keywords=[], doi='10.1073/pnas.082080899', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 646735))",
    "Paper(id='openalex_2113188272', title='Identifying, understanding, and analyzing critical infrastructure interdependencies', authors=['Steven M. Rinaldi', 'J.P. Peerenboom', 'Terrence Kelly'], abstract='The notion that our nation\\'s critical infrastructures are highly interconnected and mutually dependent in complex ways, both physically and through a host of information and communications technologies (so-called \"cyberbased systems\"), is more than an abstract, theoretical concept. As shown by the 1998 failure of the Galaxy 4 telecommunications satellite, the prolonged power crisis in California, and many other recent infrastructure disruptions, what happens to one infrastructure can directly and indirectly affect other infrastructures, impact large geographic regions and send ripples throughout the national a global economy. This article presents a conceptual framework for addressing infrastructure interdependencies that could serve as the basis for further understanding and scholarship in this important area. We use this framework to explore the challenges and complexities of interdependency. We set the stage for this discussion by explicitly defining the terms infrastructure, infrastructure dependencies, and infrastructure interdependencies and introducing the fundamental concept of infrastructures as complex adaptive systems. We then focus on the interrelated factors and system conditions that collectively define the six dimensions. Finally, we discuss some of the research challenges involved in developing, applying, and validating modeling and simulation methodologies and tools for infrastructure interdependency analysis.', url='https://openalex.org/W2113188272', published_date=None, venue='IEEE Control Systems', citations=2589, pdf_path=None, full_text=None, keywords=[], doi='10.1109/37.969131', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 647740))",
    "Paper(id='crossref_10_2991_icsshe-19_2019_91', title='Analysis on Consumer Demand of Electric Vehicle Based on Internet Survey', authors=['Yuhang Shang', 'Yi Feng'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2991/icsshe-19.2019.91', published_date=datetime.datetime(2019, 1, 1, 0, 0), venue='Proceedings of the 2019 5th International Conference on Social Science and Higher Education (ICSSHE 2019)', citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2991/icsshe-19.2019.91', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_58837_chula_the_2021_161', title='Consumer preferences and policy assessment on electric vehicle adoption in Thailand', authors=['Phasiri Manutworakit'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.58837/chula.the.2021.161', published_date=datetime.datetime(2025, 2, 21, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.58837/chula.the.2021.161', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_1007_s42791-025-00104-5', title='Consumer-centric measures for enhancing electric vehicle reliability—a case study based on automotive quality assessment survey(s)', authors=['Seungpyo Park'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.1007/s42791-025-00104-5', published_date=datetime.datetime(2025, 6, 1, 0, 0), venue='JMST Advances', citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.1007/s42791-025-00104-5', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_2139_ssrn_5149820', title='Factors Affecting Consumer Intention to Purchase an Electric Vehicle in Croatia', authors=['Vladimir Kovšca', 'Iva Gregurec', 'Zrinka Lacković Vincek'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2139/ssrn.5149820', published_date=datetime.datetime(2025, 1, 1, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2139/ssrn.5149820', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_2139_ssrn_4989383', title='Consumer Willingness to Adopt Electric Vehicle Smart Charging: A Stated Preference Analysis', authors=['Thara Philip', 'Jake Whitehead'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2139/ssrn.4989383', published_date=datetime.datetime(2024, 1, 1, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2139/ssrn.4989383', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_2139_ssrn_4781357', title='The Dynamics of Electric Vehicle Adoption Based on Strategic Consumer Choices', authors=['Wooje Seong', 'Hyunhong Choi', 'Yoonmo Koo'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2139/ssrn.4781357', published_date=datetime.datetime(2024, 1, 1, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2139/ssrn.4781357', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_2139_ssrn_4812923', title='Consumer Preferences Towards Electric Vehicle Smart Charging Program Attributes: A Stated Preference Study', authors=['Thara Philip', 'Jake Whitehead'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2139/ssrn.4812923', published_date=datetime.datetime(2024, 1, 1, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2139/ssrn.4812923', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_2139_ssrn_4750428', title='Economic Comparison of Consumer-Based Bi-Directional Electric Vehicle Charging Applications', authors=['Dominik Droese', 'Eike Stelling', 'Niklas Meltendorf', 'Julia Kowal'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2139/ssrn.4750428', published_date=datetime.datetime(2024, 1, 1, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2139/ssrn.4750428', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_1109_mce_2016_2614400', title='Around the World in an Electric Vehicle [Future Directions]', authors=['Don Christian'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.1109/mce.2016.2614400', published_date=datetime.datetime(2017, 1, 1, 0, 0), venue='IEEE Consumer Electronics Magazine', citations=1, pdf_path=None, full_text=None, keywords=[], doi='10.1109/mce.2016.2614400', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='crossref_10_2139_ssrn_4635469', title='Analysis of Consumer Preferences for New Electric Vehicle Technologies: Can a Future Vehicle Steering System Steer Consumers’ Purchase Intention?', authors=['Woojae Kim', 'Youngsang Cho'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2139/ssrn.4635469', published_date=datetime.datetime(2023, 1, 1, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2139/ssrn.4635469', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='openalex_3126081245', title='Measuring Economic Policy Uncertainty*', authors=['Scott Baker', 'Nicholas Bloom', 'Steven J. Davis'], abstract='Abstract We develop a new index of economic policy uncertainty (EPU) based on newspaper coverage frequency. Several types of evidence—including human readings of 12,000 newspaper articles—indicate that our index proxies for movements in policy-related economic uncertainty. Our U.S. index spikes near tight presidential elections, Gulf Wars I and II, the 9/11 attacks, the failure of Lehman Brothers, the 2011 debt ceiling dispute, and other major battles over fiscal policy. Using firm-level data, we find that policy uncertainty is associated with greater stock price volatility and reduced investment and employment in policy-sensitive sectors like defense, health care, finance, and infrastructure construction. At the macro level, innovations in policy uncertainty foreshadow declines in investment, output, and employment in the United States and, in a panel vector autoregressive setting, for 12 major economies. Extending our U.S. index back to 1900, EPU rose dramatically in the 1930s (from late 1931) and has drifted upward since the 1960s.', url='https://openalex.org/W3126081245', published_date=None, venue='The Quarterly Journal of Economics', citations=9822, pdf_path=None, full_text=None, keywords=[], doi='10.1093/qje/qjw024', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 645642))",
    "Paper(id='openalex_2134295053', title='Internet of Things: A Survey on Enabling Technologies, Protocols, and Applications', authors=['Ala Al‐Fuqaha', 'Mohsen Guizani', 'Mehdi Mohammadi', 'Mohammed Aledhari', 'Moussa Ayyash'], abstract='This paper provides an overview of the Internet of Things (IoT) with emphasis on enabling technologies, protocols, and application issues. The IoT is enabled by the latest developments in RFID, smart sensors, communication technologies, and Internet protocols. The basic premise is to have smart sensors collaborate directly without human involvement to deliver a new class of applications. The current revolution in Internet, mobile, and machine-to-machine (M2M) technologies can be seen as the first phase of the IoT. In the coming years, the IoT is expected to bridge diverse technologies to enable new applications by connecting physical objects together in support of intelligent decision making. This paper starts by providing a horizontal overview of the IoT. Then, we give an overview of some technical details that pertain to the IoT enabling technologies, protocols, and applications. Compared to other survey papers in the field, our objective is to provide a more thorough summary of the most relevant protocols and application issues to enable researchers and application developers to get up to speed quickly on how the different protocols fit together to deliver desired functionalities without having to go through RFCs and the standards specifications. We also provide an overview of some of the key IoT challenges presented in the recent literature and provide a summary of related research work. Moreover, we explore the relation between the IoT and other emerging technologies including big data analytics and cloud and fog computing. We also present the need for better horizontal integration among IoT services. Finally, we present detailed service use-cases to illustrate how the different protocols presented in the paper fit together to deliver desired IoT services.', url='https://openalex.org/W2134295053', published_date=None, venue='IEEE Communications Surveys & Tutorials', citations=7511, pdf_path=None, full_text=None, keywords=[], doi='10.1109/comst.2015.2444095', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 645642))",
    "Paper(id='openalex_2333930280', title=\"WHAT'S IN A NAME? REPUTATION BUILDING AND CORPORATE STRATEGY.\", authors=['Charles J. Fombrun', 'Mark Shanley'], abstract=\"Firms compete for reputational status in institutional fields. Managers attempt to influence other stakeholders' assessments by signaling firms' salient advantages. Stakeholders gauge firms' relati...\", url='https://openalex.org/W2333930280', published_date=None, venue='Academy of Management Journal', citations=4958, pdf_path=None, full_text=None, keywords=[], doi='10.2307/256324', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 646735))",
    "Paper(id='openalex_2165700542', title='Endocrine-Disrupting Chemicals: An Endocrine Society Scientific Statement', authors=['Evanthia Diamanti‐Kandarakis', 'Jean‐Pierre Bourguignon', 'Linda C. Giudice', 'Russ Hauser', 'Gail S. Prins', 'Ana M. Soto', 'R. Thomas Zoeller', 'Andrea C. Gore'], abstract='Abstract There is growing interest in the possible health threat posed by endocrine-disrupting chemicals (EDCs), which are substances in our environment, food, and consumer products that interfere with hormone biosynthesis, metabolism, or action resulting in a deviation from normal homeostatic control or reproduction. In this first Scientific Statement of The Endocrine Society, we present the evidence that endocrine disruptors have effects on male and female reproduction, breast development and cancer, prostate cancer, neuroendocrinology, thyroid, metabolism and obesity, and cardiovascular endocrinology. Results from animal models, human clinical observations, and epidemiological studies converge to implicate EDCs as a significant concern to public health. The mechanisms of EDCs involve divergent pathways including (but not limited to) estrogenic, antiandrogenic, thyroid, peroxisome proliferator-activated receptor γ, retinoid, and actions through other nuclear receptors; steroidogenic enzymes; neurotransmitter receptors and systems; and many other pathways that are highly conserved in wildlife and humans, and which can be modeled in laboratory in vitro and in vivo models. Furthermore, EDCs represent a broad class of molecules such as organochlorinated pesticides and industrial chemicals, plastics and plasticizers, fuels, and many other chemicals that are present in the environment or are in widespread use. We make a number of recommendations to increase understanding of effects of EDCs, including enhancing increased basic and clinical research, invoking the precautionary principle, and advocating involvement of individual and scientific society stakeholders in communicating and implementing changes in public policy and awareness.', url='https://openalex.org/W2165700542', published_date=None, venue='Endocrine Reviews', citations=4202, pdf_path=None, full_text=None, keywords=[], doi='10.1210/er.2009-0002', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 646735))",
    "Paper(id='crossref_10_2139_ssrn_4243828', title='Pro-environment Consumer Behavior and Electric Vehicle Adoptions: A Comparative Regional Meta-analysis', authors=['Amar Anwar', 'Arshia Khalid'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2139/ssrn.4243828', published_date=datetime.datetime(2022, 1, 1, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2139/ssrn.4243828', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))",
    "Paper(id='openalex_1661025176', title='Alternative energy technologies', authors=['M. S. Dresselhaus', 'I. L. Thomas'], abstract='Abstract not available', url='https://openalex.org/W1661025176', published_date=None, venue='Nature', citations=4605, pdf_path=None, full_text=None, keywords=[], doi='10.1038/35104599', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 646735))",
    "Paper(id='openalex_2159200188', title='The National Human Activity Pattern Survey (NHAPS): a resource for assessing exposure to environmental pollutants', authors=['Neil E. Klepeis', 'William Nelson', 'Wayne R. Ott', 'John P. Robinson', 'Andy M Tsang', 'Paul Switzer', 'Joseph V. Behar', 'Stephen C. Hern', 'W.H. Engelmann'], abstract='Abstract not available', url='https://openalex.org/W2159200188', published_date=None, venue='Journal of Exposure Science & Environmental Epidemiology', citations=4237, pdf_path=None, full_text=None, keywords=[], doi='10.1038/sj.jea.7500165', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 646735))",
    "Paper(id='openalex_1997321313', title='You are what you can access: Sharing and collaborative consumption online', authors=['Russell W. Belk'], abstract='Abstract not available', url='https://openalex.org/W1997321313', published_date=None, venue='Journal of Business Research', citations=2763, pdf_path=None, full_text=None, keywords=[], doi='10.1016/j.jbusres.2013.10.001', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 647740))",
    "Paper(id='openalex_2796568833', title='Performance and cost of materials for lithium-based rechargeable automotive batteries', authors=['Richard Schmuch', 'Ralf Wagner', 'Gerhard Hörpel', 'Tobias Placke', 'Martin Winter'], abstract='Abstract not available', url='https://openalex.org/W2796568833', published_date=None, venue='Nature Energy', citations=2718, pdf_path=None, full_text=None, keywords=[], doi='10.1038/s41560-018-0107-2', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 6, 647740))",
    "Paper(id='crossref_10_2172_1659790', title='Plug-In Electric Vehicle Showcases: Consumer Experience and Acceptance', authors=['Mark Singer'], abstract='Abstract not available from CrossRef', url='https://doi.org/10.2172/1659790', published_date=datetime.datetime(2020, 7, 1, 0, 0), venue=None, citations=0, pdf_path=None, full_text=None, keywords=[], doi='10.2172/1659790', arxiv_id=None, created_at=datetime.datetime(2025, 8, 13, 9, 45, 9, 469792))"
  ]
}